---
kind: type
id: T:Autodesk.Revit.DB.WallFoundationType
source: html/dc30ba94-ead6-e431-560c-65576cd44f63.htm
---
# Autodesk.Revit.DB.WallFoundationType

An object that represents the type of a wall foundation in Autodesk Revit.

## Syntax (C#)
```csharp
public class WallFoundationType : HostObjAttributes
```